[
    {
      "theme_name": "India-Pakistan Military Conflict & Cross-Border Actions",
      "specific_points": [
        {
          "point_summary": "PGIMER in Chandigarh is appealing for voluntary blood donations to create emergency reserves for Indian jawans serving in Jammu and Kashmir amidst current tensions.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 03:13 PM IST",
              "tweet_link": "https://x.com/ANI/status/1921139004608512479",
              "tweet_content": "#WATCH | PGIMER, Chandigarh urges voluntary blood donation to build emergency reserves in support of jawans posted on duty in Jammu and Kashmir."
            }
          ]
        },
        {
          "point_summary": "An Indian Government briefing is anticipated to provide an updated list of Pakistan Air Force (PAF) airbases that the Indian Air Force (IAF) has targeted with standoff weapons, reportedly including two additional major PAF fighter bases.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 03:07 PM IST",
              "tweet_link": "https://x.com/ShivAroor/status/1921137616268800111",
              "tweet_content": "A second Indian Govt briefing today is expected to update the PAF airbase list that the IAF has struck with standoff weapons. Two more major PAF fighter bases hit."
            }
          ]
        },
        {
          "point_summary": "India's 'Operation Sindoor' strikes reportedly killed Yusuf Azhar, Jaish-e-Mohammed Chief Masood Azhar's brother-in-law and a key figure in the IC-814 hijacking.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:57 PM IST",
              "tweet_link": "https://x.com/ani_digital/status/1921135055683965213",
              "tweet_content": "Op Sindoor strikes kill Jaish Chief Masood Azhar's brother-in-law, the man behind IC-814 hijacking Read  @ANI  Story | https://aninews.in/news/national/general-news/op-sindoor-strikes-kill-jaish-chief-masood-azhars-brother-the-man-behind-ic-814-hijacking20250510143635/… #OperationSindoor #Jaisemohammad #MasoodAzhar #Pakistan #YusufAzhar",
              "associated_embedded_links": [
                "https://aninews.in/news/national/general-news/op-sindoor-strikes-kill-jaish-chief-masood-azhars-brother-the-man-behind-ic-814-hijacking20250510143635/"
              ]
            }
          ]
        },
        {
          "point_summary": "Security agencies have recovered debris of a Pakistani drone from Dal Lake in Srinagar, indicating Pakistan's attempts to target civilian areas as part of 'Operation Sindoor'.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:55 PM IST",
              "tweet_link": "https://x.com/ndtv/status/1921134569698586943",
              "tweet_content": "India Strikes Back | Security agencies recover debris of drone from Dal Lake as Pakistan continues its attempt to strike civilian spaces  Watch this report by NDTV's  @ShivAroor  from Srinagar #OperationSindoor"
            }
          ]
        },
        {
          "point_summary": "Debris of a projectile has been found in Damtal village, Kangra district, Himachal Pradesh, near Pathankot, Punjab, following a reported blast; the area has been secured by police for expert examination.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:42 PM IST",
              "tweet_link": "https://x.com/ANI/status/1921131271700251089",
              "tweet_content": "#WATCH | Himachal Pradesh: Hollowed ground in Damtal village of Kangra district, located near Pathankot in Punjab, where debris of a projectile has been found.  Police say, \"A while ago, a blast was heard here. Following that, we reached here. We have secured the area. Experts"
            }
          ]
        },
        {
          "point_summary": "An Indian drone was reportedly stolen from Lahore’s DHA Phase 6.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:32 PM IST",
              "tweet_link": "https://x.com/AdityaRajKaul/status/1921128652432896387",
              "tweet_content": "Indian Drone stolen from Lahore’s DHA Phase 6 last night!"
            }
          ]
        },
        {
          "point_summary": "A Turkish Kamikaze Drone, allegedly used by Pakistan to target civilian areas, has been recovered in a village in the Naushera area of Jammu and Kashmir.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:19 PM IST",
              "tweet_link": "https://x.com/ANI/status/1921125312701587802",
              "tweet_content": "Turkish Kamikaze Drone recovered in a village in Naushera area of Jammu and Kashmir. Pakistan targeting civilian areas."
            }
          ]
        },
        {
          "point_summary": "'Operation Sindoor' has reportedly eliminated top Lashkar-e-Taiba (LeT) and Jaish-e-Mohammed (JeM) terrorists, including Yusuf Azhar, in Pakistan and PoK camps.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:16 PM IST",
              "tweet_link": "https://x.com/ani_digital/status/1921124751465930998",
              "tweet_content": "Op Sindoor eliminates top LeT, JeM terrorists, including Yusuf Azhar in Pakistan, PoK Camps Read  @ANI  Story | https://aninews.in/news/national/general-news/op-sindoor-eliminates-top-let-jem-terrorists-including-yusuf-azhar-in-pakistan-pok-camps20250510141149/… #OperationSindoor #MaulanaYusufAzhar #JammuKashmir",
              "associated_embedded_links": [
                "https://aninews.in/news/national/general-news/op-sindoor-eliminates-top-let-jem-terrorists-including-yusuf-azhar-in-pakistan-pok-camps20250510141149/"
              ]
            }
          ]
        },
        {
          "point_summary": "Journalist Shiv Aroor quotes an unspecified source stating, \"We are not at war.\"",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:16 PM IST",
              "tweet_link": "https://x.com/ShivAroor/status/1921124661703676126",
              "tweet_content": "“We are not at war.”"
            }
          ]
        }
      ]
    },
    {
      "theme_name": "International Diplomacy & Reactions to Tensions",
      "specific_points": [
        {
          "point_summary": "Amidst the India-Pakistan conflict, American and Saudi officials have reportedly contacted both Islamabad and Delhi, aiming to de-escalate the crisis that arose from the Pahalgam terror attack by Pakistani terrorists.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 03:09 PM IST",
              "tweet_link": "https://x.com/sidhant/status/1921137948713423022",
              "tweet_content": "India Pakistan Conflict  Since morning, Americans & Saudis have dialed Islamabad, Delhi both hoping to reduce the ongoing crisis that emerged after the Pahalgam terror attack by Pakistani terrorists."
            }
          ]
        },
        {
          "point_summary": "Saudi Arabia's Foreign Minister Faisal bin Farhan has spoken with both Indian and Pakistani foreign ministers, urging de-escalation and an end to the military confrontation.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 03:01 PM IST",
              "tweet_link": "https://x.com/sidhant/status/1921135944213688354",
              "tweet_content": "Breaking: Saudi Arabia says FM Farhan spoke to Indian, Pakistani foreign ministers; called for de-escalation, end to military confrontation  Readout"
            }
          ]
        },
        {
          "point_summary": "Aravind speculates that the US, despite providing credit to Pakistan for F-16 repairs, might be covertly assisting India with intelligence for targeting, aiming to weaken China's proxy (Pakistan).",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:58 PM IST",
              "tweet_link": "https://x.com/aravind/status/1921135209371586749",
              "tweet_content": "The US gave Pak $400m credit line to repair its F-16s, make them all fine. But now there will be no F-16s to repair. What despair. Situation for Pak looks dire. I say the US already knew. And is giving India all the info. Where to hit, what to hit. To make the China proxy split."
            }
          ]
        },
        {
          "point_summary": "Afghanistan's Ministry of Defense spokesperson, Enayatullah Khwarazmi, and the Taliban government have strongly denied Pakistan's claims that Indian missiles landed in Afghanistan or that Afghan territory was used in any Indian attack on Pakistan, with India also rejecting these claims.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:51 PM IST",
              "tweet_link": "https://x.com/AdityaRajKaul/status/1921133429921325328",
              "tweet_content": "#BREAKING: Afghan Defense Ministry spokesperson Enayatullah Khwarazmi has denied Pakistan's claim that Afghanistan's territory was used or had faced any attack by India's missile attack on Pakistan. (Afghans have always trusted Indians any day more than any Pakistani)"
            },
            {
              "posted_ist": "May 10, 2025, 02:47 PM IST",
              "tweet_link": "https://x.com/AdityaRajKaul/status/1921132599277224257",
              "tweet_content": "#BREAKING: Afghanistan has rubbished Pakistan DG ISPR’s wild claim that Indian missiles landed in Afghanistan. Taliban Spokesperson has rejected the propaganda theory. Pakistan desperate to divide India-Afghan ties after debacle in ties between Pakistan and Taliban."
            },
            {
              "posted_ist": "May 10, 2025, 02:34 PM IST",
              "tweet_link": "https://x.com/sidhant/status/1921129318366728306",
              "tweet_content": "India Pakistan conflict Breaking: India, Afghanistan reject & slam Pakistani claims of Indian missile attack on Afghanistan earlier today"
            },
            {
              "posted_ist": "May 10, 2025, 02:32 PM IST",
              "tweet_link": "https://x.com/sidhant/status/1921128625652257110",
              "tweet_content": "Spokesman for the Afghan Ministry of Defense Inayatullah Khawarizmi to Hurriyat Radio: We strongly rejected Pakistan's claim about India's missile attack on Afghan territory. No truth to such claims"
            },
            {
              "posted_ist": "May 10, 2025, 02:31 PM IST",
              "tweet_link": "https://x.com/sidhant/status/1921128482739781891",
              "tweet_content": "BREAKING: AFGHANISTAN'S TALIBAN GOVT REJECTS PAKISTANI CLAIMS OF INDIAN MISSILE ATTACK ON AFGHAN TERRITORY Spokesman for the Afghan Ministry of Defense Inayatullah Khawarizmi says no truth to Pakistani claims"
            }
          ]
        },
        {
          "point_summary": "Vinay Mohan Kwatra, India's Ambassador to the U.S., stated on CBS that Pakistan's actions demonstrate its support for terrorists rather than the civilized world.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:35 PM IST",
              "tweet_link": "https://x.com/AdityaRajKaul/status/1921129407051087913",
              "tweet_content": "Yesterday what Pakistan did actually conveys a very clear signal to all of us and to the rest of the world that they actually stand with the terrorist, not with the rest of the civilized world  - Ambassador of India to U.S.A, Vinay Mohan Kwatra on CBS."
            }
          ]
        }
      ]
    },
    {
      "theme_name": "Pakistan's Stance & Nuclear Posturing",
      "specific_points": [
        {
          "point_summary": "Pakistan initially called for a nuclear authority meeting but later retracted, claiming no such meeting was called and that the nuclear option is not being considered. This followed an earlier report about Pakistan summoning its top nuclear body.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 03:01 PM IST",
              "tweet_link": "https://x.com/ani_digital/status/1921136072689352867",
              "tweet_content": "Pak calls Nuclear authority meeting then backtracks, claims no meeting called, Nuke option not on cards Read  @ANI  Story | https://aninews.in/news/world/asia/pak-calls-nuclear-authority-meeting-then-backtracks-claims-no-meeting-called-nuke-option-not-on-cards20250510145511/… #Pakistan #ShehbazSharif #nuclearweapons",
              "associated_embedded_links": [
                "https://aninews.in/news/world/asia/pak-calls-nuclear-authority-meeting-then-backtracks-claims-no-meeting-called-nuke-option-not-on-cards20250510145511/"
              ]
            },
            {
              "posted_ist": "May 10, 2025, 02:27 PM IST",
              "tweet_link": "https://x.com/sidhant/status/1921127520272802297",
              "tweet_content": "Pakistan's nuclear bluff busts in hours. Pakistan's Defence Minister Khawaja Asif now says no meeting of the National Command Authority, which is Pakistan's top military and civil body overseeing the country's nuclear arsenal."
            },
            {
              "posted_ist": "May 10, 2025, 10:44 AM IST",
              "tweet_link": "https://x.com/sidhant/status/1921071297775145447",
              "tweet_content": "India Pakistan Conflict: From news agency Reuters: \"Pakistan summons its top nuclear body after launching offensive on India\" 2nd time Pakistan gives nuclear threat since Pahalgam terror attack. Last was the remarks by Pakistan envoy to Russia."
            }
          ]
        }
      ]
    },
    {
      "theme_name": "Indian Domestic Response & Preparedness",
      "specific_points": [
        {
          "point_summary": "Rajasthan Minister Jogaram Patel announced an all-party meeting was held to discuss the situation arising from the state's 1,070 km sensitive border with Pakistan, covering regions like Jaisalmer and Barmer.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 03:07 PM IST",
              "tweet_link": "https://x.com/ANI/status/1921137616294212059",
              "tweet_content": "#WATCH | Jaipur | Rajasthan minister Jogaram Patel says, \"... Rajasthan shares a sensitive border of about 1,070 Km with Pakistan covering regions like Jaisalmer, Barmer, Pokhran, Ganganagar and Hanumangarh. Therefore an all-party meeting was convened... I am thankful to all"
            }
          ]
        },
        {
          "point_summary": "Rajasthan Leader of Opposition Tikaram Jully confirmed the Chief Minister convened an all-party meeting to brief on government actions and the current situation, and to gather suggestions.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 03:01 PM IST",
              "tweet_link": "https://x.com/ANI/status/1921136000773873976",
              "tweet_content": "#WATCH | Jaipur | Rajasthan LoP Tikaram Jully says, \"CM called an all-party meeting. Briefing was done for the work done by the state government and the present situation. Suggestions were taken from everyone. The Indian Army is fighting the terrorists and it is important that"
            }
          ]
        },
        {
          "point_summary": "Himachal Pradesh CM Sukhvinder Singh Sukhu stated that the state is prepared for challenges from the enemy country, noting that drone shells have been recovered in Indora and SOPs from Punjab are being followed.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 03:01 PM IST",
              "tweet_link": "https://x.com/ANI/status/1921135954448052540",
              "tweet_content": "#WATCH | Shimla: On India-Pakistan tensions, Himachal Pradesh CM Sukhvinder Singh Sukhu says, \"In the coming days, the kind of challenges that will come from the enemy country, we are ready in every way...in Indora few shells of drones have been recovered...in Punjab whatever SOP"
            }
          ]
        },
        {
          "point_summary": "Himachal Pradesh CM Sukhvinder Singh Sukhu offered condolences for a soldier from Himachal who lost his life, stating the soldier will receive state honors and commending the father's brave acceptance of his son's sacrifice.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 03:00 PM IST",
              "tweet_link": "https://x.com/ANI/status/1921135668966670453",
              "tweet_content": "#WATCH | Shimla: On India-Pakistan tensions, Himachal Pradesh CM Sukhvinder Singh Sukhu says, \" A son of Himachal has laid down his life, Himachal govt condoles his death, he will be given state honours. I spoke to his father as well, he bravely said that his son sacrificed his"
            }
          ]
        },
        {
          "point_summary": "Rajasthan Deputy CM Prem Chand Bairwa confirmed the CM called an all-party meeting to discuss preparations for the current situation, seek suggestions, and urge public information gathering.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:50 PM IST",
              "tweet_link": "https://x.com/ANI/status/1921133198869684237",
              "tweet_content": "#WATCH | Jaipur | Rajasthan Dy CM Prem Chand Bairwa says, \"The CM called an all-party meeting today, in which he briefed everyone about the preparations to face the current situation and asked for their suggestion. They have also been urged to take information from the public"
            }
          ]
        },
        {
          "point_summary": "Security has been tightened near Ambala Domestic Airport in Ambala Cantonment, Haryana. The Ministry of Civil Aviation has extended the closure of 32 airports nationwide, including Ambala Airport, from May 10 to May 15.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:42 PM IST",
              "tweet_link": "https://x.com/ANI/status/1921131119551951295",
              "tweet_content": "#WATCH | Haryana | Security tightened near Ambala Domestic Airport in Ambala Cantonement.  The Ministry of Civil Aviation has extended the closure of 32 airports nationwide, including Ambala Airport, from May 10 to May 15."
            }
          ]
        },
        {
          "point_summary": "Prime Minister Narendra Modi chaired a high-level meeting at 7 Lok Kalyan Marg with Defence Minister Rajnath Singh, NSA Ajit Doval, the CDS, and Chiefs of all three Services to discuss the security situation. Subsequently, attendees including the Defence Minister, NSA, CDS, and Service Chiefs were seen leaving the venue.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:33 PM IST",
              "tweet_link": "https://x.com/ANI/status/1921128829000573297",
              "tweet_content": "#WATCH | Delhi | CDS and Chiefs of all three Services leave from the 7, LKM after attending the meeting with the PM. National Security Advisor (NSA) Ajit Doval and Defence Minister Rajnath Singh were also present in the meeting."
            },
            {
              "posted_ist": "May 10, 2025, 02:30 PM IST",
              "tweet_link": "https://x.com/ANI/status/1921128095370592498",
              "tweet_content": "#WATCH | Delhi | National Security Advisor (NSA) Ajit Doval leaves from 7, LKM. Prime Minister Narendra Modi held a meeting with Defence Minister Rajnath Singh, NSA Ajit Doval, CDS and Chiefs of all three Services, at 7, LKM."
            },
            {
              "posted_ist": "May 10, 2025, 02:27 PM IST",
              "tweet_link": "https://x.com/AdityaRajKaul/status/1921127458981425363",
              "tweet_content": "#BREAKING: Prime Minister  @narendramodi  chairs a high level meeting with Raksha Mantri Rajnath Singh, NSA Ajit Doval, CDS, Triservice Chiefs. #OperationSindoor"
            },
            {
              "posted_ist": "May 10, 2025, 02:22 PM IST",
              "tweet_link": "https://x.com/ANI/status/1921126090141003819",
              "tweet_content": "#WATCH | Defence Minister Rajnath Singh leaves from 7, LKM. Prime Minister Narendra Modi held a meeting with Defence Minister Rajnath Singh, NSA Ajit Doval, CDS and Chiefs of all three Services, at 7, LKM."
            },
            {
              "posted_ist": "May 10, 2025, 02:21 PM IST",
              "tweet_link": "https://x.com/ani_digital/status/1921125983240774117",
              "tweet_content": "PM Modi chairs high-level meeting with Defence Minister Rajnath Singh, CDS and armed forces chiefs Read  @ANI  Story | https://aninews.in/news/national/general-news/pm-modi-chairs-high-level-meeting-with-defence-minister-rajnath-singh-cds-and-armed-forces-chiefs20250510141350/… #PMModi #Pakistan #RajnathSingh",
              "associated_embedded_links": [
                "https://aninews.in/news/national/general-news/pm-modi-chairs-high-level-meeting-with-defence-minister-rajnath-singh-cds-and-armed-forces-chiefs20250510141350/"
              ]
            }
          ]
        },
        {
          "point_summary": "Punjab CM Bhagwant Mann stated that the state was prepared for Pakistani attacks, including those in Ferozepur, and will lead from the front in the current situation.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:31 PM IST",
              "tweet_link": "https://x.com/ANI/status/1921128382882083104",
              "tweet_content": "#WATCH | Mohali: On attack by Pakistan in different parts of the state, Punjab CM Bhagwant Mann says, \"...We were prepared beforehand...Punjab has fought at the front earlier too, and this time too, Punjab will lead from the front. Those who got injured in Ferozepur incident"
            }
          ]
        },
        {
          "point_summary": "India's National Disaster Management Authority (NDMA) has issued an advisory for citizens, outlining measures for national security situations, including effective communication.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:25 PM IST",
              "tweet_link": "https://x.com/sidhant/status/1921127060921004229",
              "tweet_content": "India's National Disaster Management Authority issues advisory for the citizens.  \"Measures that must be adopted in all situations hostile to our national security\" released including effective communication:"
            }
          ]
        },
        {
          "point_summary": "Punjab CM Bhagwant Mann reports Pakistan is firing and launching long-range missiles, one of which fell in Sirsa, Haryana, alongside nightly drone and missile attacks.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:16 PM IST",
              "tweet_link": "https://x.com/ANI/status/1921124649015857378",
              "tweet_content": "#WATCH | Mohali: Punjab CM Bhagwant Mann says, \"They (Pakistan) are firing and even launching long-range missiles, one of which fell in Sirsa (Haryana). They are launching drones and missiles every night...On one hand, they are firing and sending drones and on the other hand,"
            }
          ]
        },
        {
          "point_summary": "Jodhpur Collector Gaurav Agarwal announced a red alert due to the India-Pakistan situation, with air raid sirens sounded, and appealed to citizens to stay in safe places.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:16 PM IST",
              "tweet_link": "https://x.com/ANI/status/1921124594758434994",
              "tweet_content": "#WATCH | Jodhpur, Rajasthan | Collector Gaurav Agarwal says, \"In view of the situation between India and Pakistan, we received red alert guidelines this morning, due to which air raid sirens were sounded. I appeal to all the people to stay in their safe places... avoid going to"
            }
          ]
        }
      ]
    },
    {
      "theme_name": "Misinformation, Propaganda & Media Advisories",
      "specific_points": [
        {
          "point_summary": "A video claiming to show two Pakistani fighter jets shot down near Srinagar-Budgam-Baramulla in Kashmir is false; the video is actually from 2022 showing a Russian fighter jet downed by Ukraine.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 03:07 PM IST",
              "tweet_link": "https://x.com/zoo_bear/status/1921137413713207679",
              "tweet_content": "कश्मीर में श्रीनगर-बडगाम-बारामुल्ला के आसपास 2 पाकिस्तानी फ़ाइटर जेट को मार गिराए जाने के दावे के साथ एक वीडियो शेयर किया जा रहा है. जांच में सामने आया कि ये वीडियो 2022 में यूक्रेन द्वारा रशियन फाइटर जेट मार गिराए जाने का है. |  @HereisKinjal"
            }
          ]
        },
        {
          "point_summary": "An unrelated video from Indonesia showing a fire is being falsely circulated as Pakistan attacking an Indian military base in Gujarat.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 03:06 PM IST",
              "tweet_link": "https://x.com/zoo_bear/status/1921137194363715859",
              "tweet_content": "Unrelated video from Indonesia. Nothing to do with Gujarat.  Here is Alt News fact check.  https://altnews.in/video-of-a-fire-in-indonesia-goes-viral-as-pakistan-attacking-indian-military-base-amid-operation-sindoor/…",
              "associated_embedded_links": [
                "https://altnews.in/video-of-a-fire-in-indonesia-goes-viral-as-pakistan-attacking-indian-military-base-amid-operation-sindoor/"
              ]
            }
          ]
        },
        {
          "point_summary": "Sidhant notes that Pakistani misinformation machinery is currently working overtime.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:40 PM IST",
              "tweet_link": "https://x.com/sidhant/status/1921130687953764682",
              "tweet_content": "India Pakistan Conflict  Pakistani misinformation machinery is working extra now:"
            }
          ]
        },
        {
          "point_summary": "An Indian expert criticized a video released by Pakistan's ISPR showing a JF-17 fighter jet taking off as flawed propaganda, questioning why no landing footage was shown, implying the plane might not have returned.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:25 PM IST",
              "tweet_link": "https://x.com/sidhant/status/1921126907375923417",
              "tweet_content": "On the video issued by ISPR of JF 17 fighter jet taking off, an Indian expert said, \"This is next level propaganda which has gone wrong. I guess the plane never got back, that is why no video of it landing\""
            }
          ]
        },
        {
          "point_summary": "The Union Ministry of Home Affairs (MHA) has issued an advisory to media channels, including Aaj Tak, India Today, ABP, NDTV, and Times Now, to refrain from using Civil Defence Air Raid Siren sounds in programs except for community awareness drives.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:24 PM IST",
              "tweet_link": "https://x.com/zoo_bear/status/1921126605763535056",
              "tweet_content": "MHA order : Union Ministry of Home Affairs issued an advisory to all media channels to refrain from using Civil Defence Air Raid Sirens sounds in their programs other than community awareness drives.  News Channels which used Sirens : Aaj Tak, India Today, ABP, NDTV, Times Now,"
            }
          ]
        },
        {
          "point_summary": "PIB Fact Check has debunked an old video of an IAF Jaguar aircraft crash in Ambala during a routine training, which was being falsely shared in the context of the current India-Pakistan situation.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:23 PM IST",
              "tweet_link": "https://x.com/PIBFactCheck/status/1921126338116702680",
              "tweet_content": "Old IAF Plane Crash Video Shared in False Context  A video of an IAF plane crash is being falsely shared in the context of the current India-Pakistan situation. #PIBFactCheck  This video shows a Jaguar aircraft of the IAF that crashed in Ambala during a routine training"
            }
          ]
        },
        {
          "point_summary": "Visuals of a fire near Shah Faisal Mosque in Islamabad, being circulated as an Indian drone attack, are from 2024 and are being shared with false claims amid current tensions.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:20 PM IST",
              "tweet_link": "https://x.com/zoo_bear/status/1921125783432544624",
              "tweet_content": "The visuals of a fire near the Shah Faisal Mosque in Islamabad that are currently viral as a drone attack by India are actually from 2024. These are being shared with false claims amid the escalating tensions |  @HereisKinjal"
            }
          ]
        }
      ]
    },
    {
      "theme_name": "Political Statements & General Commentary",
      "specific_points": [
        {
          "point_summary": "AIMIM Chief Asaduddin Owaisi stated that Pakistan overlooks the 230 million Muslims in India whose forefathers rejected the two-nation theory, and that for 75 years, Pakistan has tried to weaken India and create Hindu-Muslim conflict.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 03:12 PM IST",
              "tweet_link": "https://x.com/ANI/status/1921138830968758275",
              "tweet_content": "#WATCH | Hyderabad, Telangana: AIMIM Chief Asaduddin Owaisi says, \" Pakistan conveniently forgets that there are more than 230 million Muslims living in India and our forefathers rejected the two-country theory. We despise, we rejected the two-nation theory proposed by Jinnah,"
            },
            {
              "posted_ist": "May 10, 2025, 03:01 PM IST",
              "tweet_link": "https://x.com/ANI/status/1921136097062474028",
              "tweet_content": "#WATCH | Hyderabad, Telangana | On India-Pakistan tensions, AIMIM chief Asaduddin Owaisi says, \"... It is a matter of great sorrow that those who broke and left this country, have left no stone unturned for the last 75 years to weaken India, to create conflict between Hindus and"
            }
          ]
        },
        {
          "point_summary": "Odisha Minister Suresh Pujari commented on the 'war-like situation' between India and Pakistan, mentioning 'Operation Sindoor' aimed at eliminating cross-border terrorism and the need for all states to be prepared.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:35 PM IST",
              "tweet_link": "https://x.com/ANI/status/1921129426789822695",
              "tweet_content": "#WATCH | Bhubaneswar | Odisha Minister Suresh Pujari says, \"There has been a war-like situation between Pakistan and India. Indian armies have already unleashed Operation Sindoor to finish terrorism from across the border. There is a war-like situation, and therefore, all states"
            }
          ]
        },
        {
          "point_summary": "Aditya Raj Kaul comments that Pakistani leaders Shehbaz Sharif and Khwaja Asif appear clueless about their country's direction, suggesting their posturing might have been rebuked by 'the real boss Munir'.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:24 PM IST",
              "tweet_link": "https://x.com/AdityaRajKaul/status/1921126641083793697",
              "tweet_content": "Shehbaz Sharif and Khwaja Asif are so clueless about their country and how to take it forward. They probably thought it would be great posturing but probably got a dressing down from the real boss Munir."
            }
          ]
        }
      ]
    },
    {
      "theme_name": "Other National News/Developments",
      "specific_points": [
        {
          "point_summary": "Uttar Pradesh CM Yogi Adityanath offered prayers at Shri Hanuman Garhi Mandir in Ayodhya.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 03:09 PM IST",
              "tweet_link": "https://x.com/ANI/status/1921137949975916672",
              "tweet_content": "#WATCH | Uttar Pradesh CM Yogi Adityanath offers prayers at Shri Hanuman Garhi Mandir in Ayodhya."
            }
          ]
        },
        {
          "point_summary": "Helicopter services to all four Dhams, including Badrinath and Kedarnath, are reported to be running smoothly from Sahastradhara helidrome in Dehradun. Uttarakhand CM Pushkar Singh Dhami also tweeted that the Chardham Yatra is proceeding smoothly with over 4 lakh devotees having visited, and heli services to Kedarnath are fully operational, cautioning against paying extra for services.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:49 PM IST",
              "tweet_link": "https://x.com/ANI/status/1921132963116577199",
              "tweet_content": "#WATCH | Uttarakhand: Helicopter service to all four Dhams, including Badrinath and Kedarnath, is running smoothly from Sahastradhara helidrome in Dehradun. CM Pushkar Singh Dhami tweets, \"Chardham Yatra is being conducted smoothly in the state. So far, more than 4 lakh devotees"
            },
            {
              "posted_ist": "May 10, 2025, 02:18 PM IST",
              "tweet_link": "https://x.com/ANI/status/1921125172834398240",
              "tweet_content": "Uttarakhand CM Pushkar Singh Dhami posts on 'X': \"Dear Devotees, Chardham Yatra is being conducted smoothly in the state. So far, more than 4 lakh devotees have visited the Dhams. Heli services for Shri Kedarnath Dham are also fully operational. You are requested not to pay"
            }
          ]
        },
        {
          "point_summary": "A tweet by Sidhant simply states 'PS: Location of Bengaluru -' without further context.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:41 PM IST",
              "tweet_link": "https://x.com/sidhant/status/1921130974961717749",
              "tweet_content": "PS: Location of Bengaluru -"
            }
          ]
        },
        {
          "point_summary": "Adani Enterprises has flagged off India’s first hydrogen fuel cell truck, aiming to promote cleaner transportation by gradually replacing diesel vehicles in its logistics operations, in collaboration with another entity.",
          "contributing_tweets": [
            {
              "posted_ist": "May 10, 2025, 02:41 PM IST",
              "tweet_link": "https://x.com/ANI/status/1921130887049101538",
              "tweet_content": "Adani Enterprises, the flagship company of the Adani Group, flagged off India’s first hydrogen fuel cell truck to promote cleaner transportation. These hydrogen-powered trucks will gradually replace diesel vehicles used in the company’s logistics operations. In collaboration with"
            }
          ]
        }
      ]
    }
  ]